Autodesk.Revit.DB.NamingUtils.CompareNames(System.String,System.String)
Compares two object name strings using Revit's comparison rules.
Remarks:
This routine is similar to System.String.Compare(), but uses Revit rules for comparison.
This involves breaking the names into alphabetic and numeric tokens and comparing tokens individually.
Neither comparand is allowed to be null.
nameA:
The first object name to compare.
nameB:
The second object name to compare.
Returns:
An integer indicating the result of the lexical comparison between the two names.
Less than zero if nameA comes before nameB in the ordering, zero if nameA and nameB are equivalent,
and greater than zero if nameA is comes after nameB in the ordering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015